# 信噪比: 35 dB, 频偏误差: 1.64 Hz, 解码成功: True, 候选消息数: 3
# 信噪比: 30 dB, 频偏误差: 0.20 Hz, 解码成功: True, 候选消息数: 2
# 信噪比: 28 dB, 频偏误差: 0.665074 Hz, 解码成功: False, 候选消息数: 2
# 信噪比: 26 dB, 频偏误差: 1.44 Hz, 解码成功: True, 候选消息数: 2
# 信噪比: 25 dB, 频偏误差: 0.43 Hz, 解码成功: True, 候选消息数: 2
# 信噪比: 23 dB, 频偏误差: -16.69 Hz, 解码成功: False, 候选消息数: 0
# 信噪比: 21 dB, 频偏误差: 338.95 Hz, 解码成功: False, 候选消息数: 0
# 信噪比: 20 dB, 频偏误差: -1859.10 Hz, 解码成功: False, 候选消息数: 0




# 2025-04-27 00:14:58,334 - __main__ - DEBUG - 频率漂移率: 100.0 Hz/s, 频偏误差: 10.58 Hz, 解码成功: True, 候选消息数: 2
# 2025-04-27 00:14:58,334 - __main__ - DEBUG - 频率漂移率: 200.0 Hz/s, 频偏误差: 8.99 Hz, 解码成功: True, 候选消息数: 2
# 2025-04-27 00:14:58,334 - __main__ - DEBUG - 频率漂移率: 300.0 Hz/s, 频偏误差: -0.74 Hz, 解码成功: True, 候选消息数: 2
# 2025-04-27 00:07:41,332 - __main__ - DEBUG - 频率漂移率: 400.0 Hz/s, 频偏误差: 4.56 Hz, 解码成功: True, 候选消息数: 3
# 2025-04-27 00:07:41,332 - __main__ - DEBUG - 频率漂移率: 500.0 Hz/s, 频偏误差: 0.54 Hz, 解码成功: True, 候选消息数: 2
# 2025-04-27 00:07:41,332 - __main__ - DEBUG - 频率漂移率: 600.0 Hz/s, 频偏误差: 2.18 Hz, 解码成功: True, 候选消息数: 1
# 2025-04-27 00:07:41,332 - __main__ - DEBUG - 频率漂移率: 700.0 Hz/s, 频偏误差: 3.12 Hz, 解码成功: True, 候选消息数: 2
# 2025-04-27 00:07:41,332 - __main__ - DEBUG - 频率漂移率: 800.0 Hz/s, 频偏误差: -2.77 Hz, 解码成功: True, 候选消息数: 3
# 2025-04-27 00:07:41,332 - __main__ - DEBUG - 频率漂移率: 900.0 Hz/s, 频偏误差: 1.08 Hz, 解码成功: True, 候选消息数: 2
